---
kind: property
id: P:Autodesk.Revit.DB.Structure.RebarShapeDefinitionBySegments.NumberOfSegments
source: html/4891447d-bf90-1246-86f7-95e4f849f9b4.htm
---
# Autodesk.Revit.DB.Structure.RebarShapeDefinitionBySegments.NumberOfSegments Property

The number of straight segments in this shape.

## Syntax (C#)
```csharp
public int NumberOfSegments { get; }
```